app/views/friends/show.html.erb

<h1><%= User.find(@friend.friend_id).name %></h1>
---
SELECT  `friends`.* FROM `friends` WHERE `friends`.`id` = 2 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1