app/views/users/show.html.erb

        	<tbody>
                <%@user.chats.each do |chat|%>
        		<tr>
                    <th><%= link_to User.find(chat.send_to_ID).name,user_chat_path(chat.user_id,chat.id) %></th>
                    <% user2=User.find(chat.send_to_ID) %>
                    <% chat2=user2.chats.find_by(send_to_ID: @user.id) %>
                    <% message=chat.messages.last %>
---
SELECT `chats`.* FROM `chats` WHERE `chats`.`user_id` = 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `chats`.* FROM `chats` WHERE `chats`.`user_id` = 2 AND `chats`.`send_to_ID` = 1 LIMIT 1
SELECT  `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 2  ORDER BY `messages`.`id` DESC LIMIT 1

        	<tbody>
                <%@user.friends.each do |friend|%>
---
SELECT `friends`.* FROM `friends` WHERE `friends`.`user_id` = 1