app/views/chats/show.html.erb

        <% a=[] %>
        <% @chat.messages.each do |message| %>
            <% a.push(message) %>
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 1
UPDATE `messages` SET `chat_id` = 12, `updated_at` = '2017-03-17 04:44:46' WHERE `messages`.`id` = 7

            <thead>
                <th colspan="2"><%= User.find(@chat.send_to_ID).name %></th>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

                        <tr>
                            <% if message.chat.user.id!=User.find(@chat.send_to_ID).id %>
---
SELECT  `chats`.* FROM `chats` WHERE `chats`.`user_id` = 3 AND `chats`.`send_to_ID` = 1 LIMIT 1