app/controllers/chats_controller.rb

    def create
        @user=User.find(params[:user_id])
        chat=@user.chats.find_by(send_to_ID: params[:chat].permit(:send_to_ID)[:send_to_ID] )
        if chat==nil
            @chat=@user.chats.create(send_to_ID: params[:chat].permit(:send_to_ID)[:send_to_ID] )
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `chats`.* FROM `chats` WHERE `chats`.`user_id` = 1 AND `chats`.`send_to_ID` = 2 LIMIT 1
INSERT INTO `chats` (`send_to_ID`, `user_id`, `created_at`, `updated_at`) VALUES (0, 6, '2017-03-16 05:09:59', '2017-03-16 05:09:59')

    def destroy
        @user=User.find(params[:user_id])
        @chat=@user.chats.find(params[:id])
        @user2=User.find(@chat.send_to_ID)
        @chat2=@user2.chats.find_by(send_to_ID: @user.id)
        @chat.messages.each do |message|
            message.destroy
        end
        @chat2.messages.each do |message|
            message.destroy
        end
        @chat.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT  `chats`.* FROM `chats` WHERE `chats`.`user_id` = 3 AND `chats`.`id` = 19 LIMIT 1
SELECT  `chats`.* FROM `chats` WHERE `chats`.`user_id` = 4 AND `chats`.`send_to_ID` = 1 LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 12
DELETE FROM `messages` WHERE `messages`.`id` = 19
DELETE FROM `chats` WHERE `chats`.`id` = 6

    def new
        @user=User.find(params[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1

    def show
        @user=User.find(params[:user_id])
        @chat=@user.chats.find(params[:id])
        @user2=User.find(@chat.send_to_ID)
        if @user2.chats.find_by(send_to_ID: @user.id)==nil
            @chat2=@user2.chats.create(send_to_ID: @user.id)
            @user2.friends.create(friend_id: @user.id)
        else
        @chat2=@user2.chats.find_by(send_to_ID: @user.id)
        end
        @chat2.messages.each do |message|
            message.read = true
            message.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `chats`.* FROM `chats` WHERE `chats`.`user_id` = 1 AND `chats`.`id` = 2 LIMIT 1
SELECT  `chats`.* FROM `chats` WHERE `chats`.`user_id` = 3 AND `chats`.`send_to_ID` = 1 LIMIT 1
INSERT INTO `chats` (`send_to_ID`, `user_id`, `created_at`, `updated_at`) VALUES (3, 1, '2017-03-17 05:55:05', '2017-03-17 05:55:05')
INSERT INTO `friends` (`friend_id`, `user_id`, `created_at`, `updated_at`) VALUES (3, 1, '2017-03-17 05:57:48', '2017-03-17 05:57:48')
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 1
UPDATE `messages` SET `chat_id` = 7, `updated_at` = '2017-03-17 04:42:05' WHERE `messages`.`id` = 8