app/controllers/friends_controller.rb

    def new
        @user=User.find(params[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

    def create
        @user=User.find(params[:user_id])
        @friend=@user.friends.create(friend_id: params[:friend].permit(:friend_id)[:friend_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `friends` (`friend_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2017-03-16 07:50:18', '2017-03-16 07:50:18')

    def destroy
        @friend=Friend.find(params[:id])
        @friend.destroy
---
SELECT  `friends`.* FROM `friends` WHERE `friends`.`id` = NULL LIMIT 1
DELETE FROM `friends` WHERE `friends`.`id` = 4

    def show
        @friend=Friend.find(params[:id])
        @user=User.find(params[:user_id])
---
SELECT  `friends`.* FROM `friends` WHERE `friends`.`id` = 2 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1