app/controllers/messages_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `chats`.* FROM `chats` WHERE `chats`.`user_id` = 1 AND `chats`.`id` = 1 LIMIT 1
INSERT INTO `messages` (`text`, `chat_id`, `created_at`, `updated_at`) VALUES ('へえええー', 1, '2017-03-17 02:10:55', '2017-03-17 02:10:55')
---
    def create
        @user=User.find(params[:user_id])
        @chat=@user.chats.find(params[:chat_id])
        @message=@chat.messages.create(text: params[:message].permit(:text)[:text])