app/controllers/users_controller.rb

    def create
        @user=User.new(set_user)
        if @user.save
---
INSERT INTO `users` (`name`, `lineID`, `created_at`, `updated_at`) VALUES ('ぬっくん', 'nukkunn', '2017-03-16 01:42:58', '2017-03-16 01:42:58')

    def edit
        @user=User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

    def update
        @user=User.find(params[:id])
        if @user.update(set_user)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `name` = 'ぬくみずよういち', `updated_at` = '2017-03-16 02:07:11' WHERE `users`.`id` = 2

    def destroy
        @user=User.find(params[:id])
        @user.chats.each do |chat|
            user2=User.find(chat.send_to_ID)
            chat2=user2.chats.find_by(send_to_ID: @user.id)
            chat.messages.each do |message|
                message.destroy
            end
            chat2.messages.each do |message|
                message.destroy
            end
            chat2.destroy
            chat.destroy
        end
        @user.friends.each do |friend|
            user3=User.find(friend.friend_id)
            friend2=user3.friends.find_by(friend_id: @user.id)
            friend2.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`user_id` = 6
SELECT  `chats`.* FROM `chats` WHERE `chats`.`user_id` = 4 AND `chats`.`send_to_ID` = 6 LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 30
DELETE FROM `messages` WHERE `messages`.`id` = 69
DELETE FROM `chats` WHERE `chats`.`id` = 31
DELETE FROM `users` WHERE `users`.`id` = 4
SELECT  `friends`.* FROM `friends` WHERE `friends`.`user_id` = 4 AND `friends`.`friend_id` = 6 LIMIT 1
DELETE FROM `friends` WHERE `friends`.`id` = 23